platformio/platform-ststm32/misc/svd/STM32F777.svd
        <register>
          <name>DHTMEM87</name>
          <displayName>DHTMEM87</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM88</name>
          <displayName>DHTMEM88</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM89</name>
          <displayName>DHTMEM89</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM90</name>
          <displayName>DHTMEM90</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM91</name>
          <displayName>DHTMEM91</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM92</name>
          <displayName>DHTMEM92</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM93</name>
          <displayName>DHTMEM93</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM94</name>
          <displayName>DHTMEM94</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM95</name>
          <displayName>DHTMEM95</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM96</name>
          <displayName>DHTMEM96</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM97</name>
          <displayName>DHTMEM97</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM98</name>
          <displayName>DHTMEM98</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM99</name>
          <displayName>DHTMEM99</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM100</name>
          <displayName>DHTMEM100</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM101</name>
          <displayName>DHTMEM101</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM102</name>
          <displayName>DHTMEM102</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM103</name>
          <displayName>DHTMEM103</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x4F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_0</name>
          <displayName>HUFFENC_AC0_0</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_1</name>
          <displayName>HUFFENC_AC0_1</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_2</name>
          <displayName>HUFFENC_AC0_2</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_3</name>
          <displayName>HUFFENC_AC0_3</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x50C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_4</name>
          <displayName>HUFFENC_AC0_4</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x510</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_5</name>
          <displayName>HUFFENC_AC0_5</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x514</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_6</name>
          <displayName>HUFFENC_AC0_6</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_7</name>
          <displayName>HUFFENC_AC0_7</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x51C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_8</name>
          <displayName>HUFFENC_AC0_8</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x520</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_9</name>
          <displayName>HUFFENC_AC0_9</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x524</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_10</name>
          <displayName>HUFFENC_AC0_10</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x528</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_11</name>
          <displayName>HUFFENC_AC0_11</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x52C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_12</name>
          <displayName>HUFFENC_AC0_12</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x530</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_13</name>
          <displayName>HUFFENC_AC0_13</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x534</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_14</name>
          <displayName>HUFFENC_AC0_14</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x538</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_15</name>
          <displayName>HUFFENC_AC0_15</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x53C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_16</name>
          <displayName>HUFFENC_AC0_16</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x540</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_17</name>
          <displayName>HUFFENC_AC0_17</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x544</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_18</name>
          <displayName>HUFFENC_AC0_18</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x548</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_19</name>
          <displayName>HUFFENC_AC0_19</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x54C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_20</name>
          <displayName>HUFFENC_AC0_20</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x550</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_21</name>
          <displayName>HUFFENC_AC0_21</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x554</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0_22</name>
          <displayName>HUFFENC_AC0_22</displayName>
          <description>JPEG encoder, AC Huffman table
          0</description>
          <addressOffset>0x558</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
