platformio/platform-ststm32/misc/svd/STM32F777.svd
        <register>
          <name>DSI_WPCR2</name>
          <displayName>DSI_WPCR2</displayName>
          <description>DSI Wrapper PHY Configuration Register
          2</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LPRXFT</name>
              <description>Low-Power RX low-pass Filtering
              Tuning</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLPRXLPM</name>
              <description>Forces LP Receiver in Low-Power
              Mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSTXSRCDL</name>
              <description>High-Speed Transmission Slew Rate
              Control on Data Lanes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HSTXSRCCL</name>
              <description>High-Speed Transmission Slew Rate
              Control on Clock Lane</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SDCC</name>
              <description>SDD Control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPSRDL</name>
              <description>Low-Power transmission Slew Rate
              Compensation on Data Lanes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPSRCL</name>
              <description>Low-Power transmission Slew Rate
              Compensation on Clock Lane</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HSTXDLL</name>
              <description>High-Speed Transmission Delay on Data
              Lanes</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HSTXDCL</name>
              <description>High-Speed Transmission Delay on Clock
              Lane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WPCR3</name>
          <displayName>DSI_WPCR3</displayName>
          <description>DSI Wrapper PHY Configuration Register
          3</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>THSTRAIL</name>
              <description>tHSTRAIL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>THSPREP</name>
              <description>tHS-PREPARE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TCLKZEO</name>
              <description>tCLK-ZERO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TCLKPREP</name>
              <description>tCLK-PREPARE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WPCR4</name>
          <displayName>DSI_WPCR4</displayName>
          <description>DSI_WPCR4</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x3133302A</resetValue>
          <fields>
            <field>
              <name>TLPXC</name>
              <description>tLPXC for Clock lane</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>THSEXIT</name>
              <description>tHSEXIT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TLPXD</name>
              <description>tLPX for Data lanes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>THSZERO</name>
              <description>tHS-ZERO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WPCR5</name>
          <displayName>DSI_WPCR5</displayName>
          <description>DSI Wrapper PHY Configuration Register
          5</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>THSZERO</name>
              <description>tCLK-POST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_WRPCR</name>
          <displayName>DSI_WRPCR</displayName>
          <description>DSI Wrapper Regulator and PLL Control
          Register</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REGEN</name>
              <description>Regulator Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ODF</name>
              <description>PLL Output Division Factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IDF</name>
              <description>PLL Input Division Factor</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NDIV</name>
              <description>PLL Loop Division Factor</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>PLLEN</name>
              <description>PLL Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
